In [1]:
import pandas as pd

In [2]:
# reading the csv file
df_exams = pd.read_csv("StudentsPerformance.csv")
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Math Operations

## Operations in columns

In [3]:
# showing the sum
df_exams["math score"].sum()

66089

In [4]:
# showing the count
df_exams["math score"].count()

1000

In [5]:
# showing the mean
df_exams["math score"].mean()

66.089

In [6]:
# showing the median
df_exams["math score"].median()

66.0

In [7]:
# showing the minimum
df_exams["math score"].min()

0

In [8]:
# showing the maximum
df_exams["math score"].max()

100

In [9]:
# showing the standard deviation
df_exams["math score"].std()

15.163080096009468

In [10]:
# easier calculation with .describe()
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

## Operations in rows

In [11]:
# calculating the sum in a row
df_exams["math score"] + df_exams["reading score"] + df_exams["writing score"]

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [14]:
# calculating the average of values across rows, rounding it up and assigning it to a variable
df_exams["average"] = round((df_exams["math score"] + df_exams["reading score"] + df_exams["writing score"])/3, 2)

In [15]:
# showing the dataframe
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33